# series

In [1]:
import numpy as np
import pandas as pd

In [3]:
labels = ['a', 'b', 'c']
my_list = [10, 20, 30]
arr = np.array(my_list)
d = {'a': 10, 'b': 20, 'c': 30}

In [4]:
labels

['a', 'b', 'c']

In [5]:
my_list

[10, 20, 30]

In [6]:
arr

array([10, 20, 30])

In [7]:
d

{'a': 10, 'b': 20, 'c': 30}

In [9]:
pd.Series(data = my_list, index = labels)

a    10
b    20
c    30
dtype: int64

In [10]:
pd.Series(my_list, labels)

a    10
b    20
c    30
dtype: int64

In [11]:
pd.Series(arr, labels)

a    10
b    20
c    30
dtype: int64

In [12]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [13]:
pd.Series(labels)

0    a
1    b
2    c
dtype: object

In [14]:
pd.Series(data = [sum, len])

0    <built-in function sum>
1    <built-in function len>
dtype: object

In [15]:
ser1 = pd.Series([1, 2, 3, 4], ['USA', 'Germany', 'USSR', 'Japan'])

In [16]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [18]:
ser1.index

Index(['USA', 'Germany', 'USSR', 'Japan'], dtype='object')

In [21]:
ser2 = pd.Series([1, 2, 5, 4], ['USA', 'Germany', 'Italy', 'Japan'])

In [22]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [23]:
ser3 = pd.Series(data = labels)

In [24]:
ser3

0    a
1    b
2    c
dtype: object

In [25]:
ser1 + ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

# dataframe

In [27]:
from numpy.random import randn

In [28]:
np.random.seed(101)

In [35]:
df = pd.DataFrame(randn(5, 4), index = 'A B C D E'.split(), columns='W X Y Z'.split())

In [36]:
df

          W         X         Y         Z
A -1.467514 -0.494095 -0.162535  0.485809
B  0.392489  0.221491 -0.855196  1.541990
C  0.666319 -0.538235 -0.568581  1.407338
D  0.641806 -0.905100 -0.391157  1.028293
E -1.972605 -0.866885  0.720788 -1.223082

In [37]:
df['W']

A   -1.467514
B    0.392489
C    0.666319
D    0.641806
E   -1.972605
Name: W, dtype: float64

In [39]:
type(df['W'])

pandas.core.series.Series

In [40]:
df['W'].dtype

dtype('float64')

In [41]:
df.W

A   -1.467514
B    0.392489
C    0.666319
D    0.641806
E   -1.972605
Name: W, dtype: float64

In [42]:
df[['W', 'Z']]

          W         Z
A -1.467514  0.485809
B  0.392489  1.541990
C  0.666319  1.407338
D  0.641806  1.028293
E -1.972605 -1.223082

In [43]:
df['New'] = df['W'] + df['Y']

In [44]:
df['New']

A   -1.630049
B   -0.462707
C    0.097738
D    0.250649
E   -1.251818
Name: New, dtype: float64

In [45]:
df

          W         X         Y         Z       New
A -1.467514 -0.494095 -0.162535  0.485809 -1.630049
B  0.392489  0.221491 -0.855196  1.541990 -0.462707
C  0.666319 -0.538235 -0.568581  1.407338  0.097738
D  0.641806 -0.905100 -0.391157  1.028293  0.250649
E -1.972605 -0.866885  0.720788 -1.223082 -1.251818

In [48]:
df.drop('New', axis=1)

          W         X         Y         Z
A -1.467514 -0.494095 -0.162535  0.485809
B  0.392489  0.221491 -0.855196  1.541990
C  0.666319 -0.538235 -0.568581  1.407338
D  0.641806 -0.905100 -0.391157  1.028293
E -1.972605 -0.866885  0.720788 -1.223082

In [49]:
df.drop('A')

          W         X         Y         Z       New
B  0.392489  0.221491 -0.855196  1.541990 -0.462707
C  0.666319 -0.538235 -0.568581  1.407338  0.097738
D  0.641806 -0.905100 -0.391157  1.028293  0.250649
E -1.972605 -0.866885  0.720788 -1.223082 -1.251818

In [50]:
df

          W         X         Y         Z       New
A -1.467514 -0.494095 -0.162535  0.485809 -1.630049
B  0.392489  0.221491 -0.855196  1.541990 -0.462707
C  0.666319 -0.538235 -0.568581  1.407338  0.097738
D  0.641806 -0.905100 -0.391157  1.028293  0.250649
E -1.972605 -0.866885  0.720788 -1.223082 -1.251818

In [52]:
df.drop('New', axis=1, inplace=True)

In [53]:
df

          W         X         Y         Z
A -1.467514 -0.494095 -0.162535  0.485809
B  0.392489  0.221491 -0.855196  1.541990
C  0.666319 -0.538235 -0.568581  1.407338
D  0.641806 -0.905100 -0.391157  1.028293
E -1.972605 -0.866885  0.720788 -1.223082

In [56]:
df.drop('E', inplace=True)

In [57]:
df

          W         X         Y         Z
A -1.467514 -0.494095 -0.162535  0.485809
B  0.392489  0.221491 -0.855196  1.541990
C  0.666319 -0.538235 -0.568581  1.407338
D  0.641806 -0.905100 -0.391157  1.028293

In [58]:
df.shape

(4, 4)

In [60]:
df.loc['A']

W   -1.467514
X   -0.494095
Y   -0.162535
Z    0.485809
Name: A, dtype: float64

In [65]:
df.iloc[0]

W   -1.467514
X   -0.494095
Y   -0.162535
Z    0.485809
Name: A, dtype: float64

In [67]:
df.loc['A', 'Y']

-0.1625347347726149

In [70]:
df.loc[['A', 'C'], ['W', 'Y']]

          W         Y
A -1.467514 -0.162535
C  0.666319 -0.568581

In [71]:
df = pd.DataFrame(randn(5, 4), index = 'A B C D E'.split(), columns='W X Y Z'.split())

In [72]:
df

          W         X         Y         Z
A  1.606780 -1.115710 -1.385379 -1.329660
B  0.041460 -0.411055 -0.771329  0.110477
C -0.804652  0.253548  0.649148  0.358941
D -1.080471  0.902398  0.161781  0.833029
E  0.975720 -0.388239  0.783316 -0.708954

In [73]:
df > 0

       W      X      Y      Z
A   True  False  False  False
B   True  False  False   True
C  False   True   True   True
D  False   True   True   True
E   True  False   True  False

In [75]:
bool_df = df > 0

In [76]:
bool_df

       W      X      Y      Z
A   True  False  False  False
B   True  False  False   True
C  False   True   True   True
D  False   True   True   True
E   True  False   True  False

In [77]:
df[bool_df]

         W         X         Y         Z
A  1.60678       NaN       NaN       NaN
B  0.04146       NaN       NaN  0.110477
C      NaN  0.253548  0.649148  0.358941
D      NaN  0.902398  0.161781  0.833029
E  0.97572       NaN  0.783316       NaN

In [79]:
df[df > 0]

         W         X         Y         Z
A  1.60678       NaN       NaN       NaN
B  0.04146       NaN       NaN  0.110477
C      NaN  0.253548  0.649148  0.358941
D      NaN  0.902398  0.161781  0.833029
E  0.97572       NaN  0.783316       NaN

In [81]:
df['W'] > 0

A     True
B     True
C    False
D    False
E     True
Name: W, dtype: bool

In [93]:
df[df['W'] > 0]

         W         X         Y         Z
A  1.60678 -1.115710 -1.385379 -1.329660
B  0.04146 -0.411055 -0.771329  0.110477
E  0.97572 -0.388239  0.783316 -0.708954

In [98]:
df[df['Z'] > 0]

          W         X         Y         Z
B  0.041460 -0.411055 -0.771329  0.110477
C -0.804652  0.253548  0.649148  0.358941
D -1.080471  0.902398  0.161781  0.833029

In [99]:
result_df = df[df['Z'] > 0]

In [100]:
result_df

          W         X         Y         Z
B  0.041460 -0.411055 -0.771329  0.110477
C -0.804652  0.253548  0.649148  0.358941
D -1.080471  0.902398  0.161781  0.833029

In [101]:
result_df['X']

B   -0.411055
C    0.253548
D    0.902398
Name: X, dtype: float64

In [102]:
df[df['Z'] > 0]['X']

B   -0.411055
C    0.253548
D    0.902398
Name: X, dtype: float64

In [104]:
df[df['Z'] > 0]

          W         X         Y         Z
B  0.041460 -0.411055 -0.771329  0.110477
C -0.804652  0.253548  0.649148  0.358941
D -1.080471  0.902398  0.161781  0.833029

In [105]:
df[df['Y'] > 0]

          W         X         Y         Z
C -0.804652  0.253548  0.649148  0.358941
D -1.080471  0.902398  0.161781  0.833029
E  0.975720 -0.388239  0.783316 -0.708954

In [113]:
df[(df['Z'] > 0) & (df['Y'] > 0)]

          W         X         Y         Z
B  0.041460 -0.411055 -0.771329  0.110477
C -0.804652  0.253548  0.649148  0.358941
D -1.080471  0.902398  0.161781  0.833029
E  0.975720 -0.388239  0.783316 -0.708954

In [114]:
df[(df['Z'] > 0) | (df['Y'] > 0)]

          W         X         Y         Z
B  0.041460 -0.411055 -0.771329  0.110477
C -0.804652  0.253548  0.649148  0.358941
D -1.080471  0.902398  0.161781  0.833029
E  0.975720 -0.388239  0.783316 -0.708954

In [115]:
df

          W         X         Y         Z
A  1.606780 -1.115710 -1.385379 -1.329660
B  0.041460 -0.411055 -0.771329  0.110477
C -0.804652  0.253548  0.649148  0.358941
D -1.080471  0.902398  0.161781  0.833029
E  0.975720 -0.388239  0.783316 -0.708954

In [121]:
df.reset_index(inplace = True)

In [123]:
df

  index         W         X         Y         Z
0     A  1.606780 -1.115710 -1.385379 -1.329660
1     B  0.041460 -0.411055 -0.771329  0.110477
2     C -0.804652  0.253548  0.649148  0.358941
3     D -1.080471  0.902398  0.161781  0.833029
4     E  0.975720 -0.388239  0.783316 -0.708954

In [124]:
df.shape

(5, 5)

In [134]:
new_index = 'CA NY WY OR CO'.split()

In [135]:
new_index

['CA', 'NY', 'WY', 'OR', 'CO']

In [136]:
df['States'] = new_index

In [137]:
df

  index         W         X         Y         Z States
0     A  1.606780 -1.115710 -1.385379 -1.329660     CA
1     B  0.041460 -0.411055 -0.771329  0.110477     NY
2     C -0.804652  0.253548  0.649148  0.358941     WY
3     D -1.080471  0.902398  0.161781  0.833029     OR
4     E  0.975720 -0.388239  0.783316 -0.708954     CO

In [139]:
df.set_index('States', inplace=True)

In [140]:
df

       index         W         X         Y         Z
States
CA         A  1.606780 -1.115710 -1.385379 -1.329660
NY         B  0.041460 -0.411055 -0.771329  0.110477
WY         C -0.804652  0.253548  0.649148  0.358941
OR         D -1.080471  0.902398  0.161781  0.833029
CO         E  0.975720 -0.388239  0.783316 -0.708954

In [148]:
df

       index         W         X         Y         Z
States
CA         A  1.606780 -1.115710 -1.385379 -1.329660
NY         B  0.041460 -0.411055 -0.771329  0.110477
WY         C -0.804652  0.253548  0.649148  0.358941
OR         D -1.080471  0.902398  0.161781  0.833029
CO         E  0.975720 -0.388239  0.783316 -0.708954

# multi-index and index hierarchy

In [155]:
outside = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2']
inside = [1, 2, 3, 1, 2, 3]
hier_index = list(zip(outside, inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [158]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [159]:
np.random.seed(101)

In [166]:
df = pd.DataFrame(np.random.randn(6, 2), index=hier_index, columns='A B'.split())

In [167]:
df

             A         B
G1 1  0.558769  1.024810
   2 -0.925874  1.862864
   3 -1.133817  0.610478
G2 1  0.386030  2.084019
   2 -0.376519  0.230336
   3  0.681209  1.035125

array([[ 0.18869531, -0.75887206],
       [-0.93323722,  0.95505651],
       [ 0.19079432,  1.97875732],
       [ 2.60596728,  0.68350889],
       [ 0.30266545,  1.69372293],
       [-1.70608593, -1.15911942]])

In [168]:
df.loc['G1']

          A         B
1  0.558769  1.024810
2 -0.925874  1.862864
3 -1.133817  0.610478

In [169]:
df.loc['G1'].loc[1]

A    0.558769
B    1.024810
Name: 1, dtype: float64

In [171]:
df.index.names = 'Group Num'.split()

In [172]:
df

                  A         B
Group Num
G1    1    0.558769  1.024810
      2   -0.925874  1.862864
      3   -1.133817  0.610478
G2    1    0.386030  2.084019
      2   -0.376519  0.230336
      3    0.681209  1.035125

In [174]:
df.loc['G2'].loc[2]['B']

0.23033634359240704

In [175]:
df.loc['G2'].loc[2].loc['B']

0.23033634359240704

In [176]:
df.loc['G1']

            A         B
Num
1    0.558769  1.024810
2   -0.925874  1.862864
3   -1.133817  0.610478

In [177]:
df.xs('G1')

            A         B
Num
1    0.558769  1.024810
2   -0.925874  1.862864
3   -1.133817  0.610478

In [186]:
df.xs('G1', level='Group')

            A         B
Num
1    0.558769  1.024810
2   -0.925874  1.862864
3   -1.133817  0.610478

In [187]:
df.xs(1, level='Num')

              A         B
Group
G1     0.558769  1.024810
G2     0.386030  2.084019

# missing data

In [188]:
df = pd.DataFrame({'A': [1, 2, np.nan], 'B': [5, np.nan, np.nan], 'C': [1, 2, 3]})

In [189]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [190]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [191]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [192]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [193]:
df.fillna(value='Value')

       A      B  C
0    1.0    5.0  1
1    2.0  Value  2
2  Value  Value  3

In [195]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

# groupby

In [200]:
data = {
    'Company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
    'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
    'Sales': [200, 120, 340, 124, 243, 350]
}

In [201]:
data

{'Company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
 'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
 'Sales': [200, 120, 340, 124, 243, 350]}

In [202]:
df = pd.DataFrame(data)

In [203]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [216]:
df['Sales'].dtype

dtype('int64')

In [218]:
by_comp = df.groupby('Company')

In [220]:
by_comp.sum()

             Person  Sales
Company
FB        CarlSarah    593
GOOG     SamCharlie    320
MSFT     AmyVanessa    464

In [221]:
by_comp.sum().loc['FB']

Person    CarlSarah
Sales           593
Name: FB, dtype: object

In [222]:
df.groupby('Company').min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [224]:
df.groupby('Company').max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [225]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [226]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

# merging, joining and concatenating

In [236]:
df1 = pd.DataFrame({
    'A': ['A0', 'A1', 'A2', 'A3'],
    'B': ['B0', 'B1', 'B2', 'B3'],
    'C': ['C0', 'C1', 'C2', 'C3'],
    'D': ['D0', 'D1', 'D2', 'D3'],
}, index=[0, 1, 2, 3])

In [237]:
df2 = pd.DataFrame({
    'A': ['A4', 'A5', 'A6', 'A7'],
    'B': ['B4', 'B5', 'B6', 'B7'],
    'C': ['C4', 'C5', 'C6', 'C7'],
    'D': ['D4', 'D5', 'D6', 'D7'],
}, index=[4, 5, 6, 7])

In [238]:
df3 = pd.DataFrame({
    'A': ['A8', 'A9', 'A10', 'A11'],
    'B': ['B8', 'B9', 'B10', 'B11'],
    'C': ['C8', 'C9', 'C10', 'C11'],
    'D': ['D8', 'D9', 'D10', 'D11'],
}, index=[8, 9, 10, 11])

In [239]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [240]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [241]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [242]:
df = pd.concat([df1, df2, df3])

In [243]:
df

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [244]:
pd.concat([df1, df2, df3], axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [265]:
left = pd.DataFrame({
    'key': ['K0', 'K1', 'K2', 'K3'],
    'A': ['A0', 'A1', 'A2', 'A3'],
    'B': ['B0', 'B1', 'B2', 'B3'],
})

In [266]:
right = pd.DataFrame({
    'key': ['K0', 'K1', 'K2', 'K3'],
    'C': ['C0', 'C1', 'C2', 'C3'],
    'D': ['D0', 'D1', 'D2', 'D3'],    
})

In [267]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [268]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [269]:
df = pd.merge(left, right, how='inner', on='key')

In [270]:
df

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [271]:
left = pd.DataFrame({
    'key1': ['K0', 'K0', 'K1', 'K2'],
    'key2': ['K0', 'K1', 'K0', 'K1'],
    'A': ['A0', 'A1', 'A2', 'A3'],
    'B': ['B0', 'B1', 'B2', 'B3'],
})

In [272]:
right = pd.DataFrame({
    'key1': ['K0', 'K1', 'K1', 'K2'],
    'key2': ['K0', 'K0', 'K0', 'K0'],
    'C': ['C0', 'C1', 'C2', 'C3'],
    'D': ['D0', 'D1', 'D2', 'D3'],    
})

In [273]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [274]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [275]:
pd.merge(left, right, on=['key1', 'key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [276]:
pd.merge(left, right, on=['key1', 'key2'], how='outer')

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K0  NaN  NaN   C3   D3
5   K2   K1   A3   B3  NaN  NaN

# operations

In [277]:
df = pd.DataFrame({'col1': [1, 2, 3, 4], 'col2': [444, 555, 666, 444], 'col3': ['abc', 'def', 'ghi', 'xyz']})

In [278]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [279]:
df['col2'].unique()

array([444, 555, 666])

In [280]:
len(df['col2'].unique())

3

In [281]:
df['col2'].nunique()

3

In [282]:
df['col2'].value_counts

<bound method IndexOpsMixin.value_counts of 0    444
1    555
2    666
3    444
Name: col2, dtype: int64>

In [283]:
df['col2'].value_counts()

col2
444    2
555    1
666    1
Name: count, dtype: int64

In [284]:
df[df['col1'] > 2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [285]:
df[ (df['col1'] > 2) & (df['col2'] == 444) ]

   col1  col2 col3
3     4   444  xyz

In [287]:
df[ (df['col1'] > 2) | (df['col2'] == 555) ]

   col1  col2 col3
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [288]:
def times2(x):
    return x*2

In [291]:
df['col1']

0    1
1    2
2    3
3    4
Name: col1, dtype: int64

In [292]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [295]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [298]:
df['col2'].apply(lambda x: x + 111)

0    555
1    666
2    777
3    555
Name: col2, dtype: int64

In [299]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [302]:
df.drop('col1', axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [303]:
df.drop(0)

   col1  col2 col3
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [304]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [305]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [306]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [307]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [308]:
data = {
    'A': ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'],
    'B': ['one', 'one', 'two', 'two', 'one', 'one'],
    'C': ['x', 'y', 'x', 'y', 'x', 'y'],
    'D': [1, 3, 2, 5, 4, 1]
}

In [309]:
data

{'A': ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'],
 'B': ['one', 'one', 'two', 'two', 'one', 'one'],
 'C': ['x', 'y', 'x', 'y', 'x', 'y'],
 'D': [1, 3, 2, 5, 4, 1]}

In [310]:
df = pd.DataFrame(data)

In [311]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [312]:
df.pivot_table(values='D', index=['A', 'B'], columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

# I/O